# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Tue Mar 24 08:28:46 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design parallel

create_clock -name "clk" -period 4.0 -waveform {0.0 2.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.15 [get_ports {C[0]}]
set_load -pin_load 0.15 [get_ports {C[1]}]
set_load -pin_load 0.15 [get_ports {C[2]}]
set_load -pin_load 0.15 [get_ports {C[3]}]
set_load -pin_load 0.15 [get_ports {C[4]}]
set_load -pin_load 0.15 [get_ports {C[5]}]
set_load -pin_load 0.15 [get_ports {C[6]}]
set_load -pin_load 0.15 [get_ports {C[7]}]
set_load -pin_load 0.15 [get_ports {C[8]}]
set_load -pin_load 0.15 [get_ports {C[9]}]
set_load -pin_load 0.15 [get_ports {C[10]}]
set_load -pin_load 0.15 [get_ports {C[11]}]
set_load -pin_load 0.15 [get_ports {C[12]}]
set_load -pin_load 0.15 [get_ports {C[13]}]
set_load -pin_load 0.15 [get_ports {C[14]}]
set_load -pin_load 0.15 [get_ports {C[15]}]
set_load -pin_load 0.15 [get_ports {C[16]}]
set_load -pin_load 0.15 [get_ports {C[17]}]
set_load -pin_load 0.15 [get_ports {C[18]}]
set_load -pin_load 0.15 [get_ports {C[19]}]
set_load -pin_load 0.15 [get_ports {C[20]}]
set_load -pin_load 0.15 [get_ports {C[21]}]
set_load -pin_load 0.15 [get_ports {C[22]}]
set_load -pin_load 0.15 [get_ports {C[23]}]
set_load -pin_load 0.15 [get_ports {C[24]}]
set_load -pin_load 0.15 [get_ports {C[25]}]
set_load -pin_load 0.15 [get_ports {C[26]}]
set_load -pin_load 0.15 [get_ports {C[27]}]
set_load -pin_load 0.15 [get_ports {C[28]}]
set_load -pin_load 0.15 [get_ports {C[29]}]
set_load -pin_load 0.15 [get_ports {C[30]}]
set_load -pin_load 0.15 [get_ports {C[31]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {A[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {B[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {C[31]}]
set_max_fanout 30.000 [current_design]
set_max_capacitance 30.0 [get_ports clk]
set_max_capacitance 30.0 [get_ports rst]
set_max_capacitance 30.0 [get_ports {A[0]}]
set_max_capacitance 30.0 [get_ports {A[1]}]
set_max_capacitance 30.0 [get_ports {A[2]}]
set_max_capacitance 30.0 [get_ports {A[3]}]
set_max_capacitance 30.0 [get_ports {A[4]}]
set_max_capacitance 30.0 [get_ports {A[5]}]
set_max_capacitance 30.0 [get_ports {A[6]}]
set_max_capacitance 30.0 [get_ports {A[7]}]
set_max_capacitance 30.0 [get_ports {A[8]}]
set_max_capacitance 30.0 [get_ports {A[9]}]
set_max_capacitance 30.0 [get_ports {A[10]}]
set_max_capacitance 30.0 [get_ports {A[11]}]
set_max_capacitance 30.0 [get_ports {A[12]}]
set_max_capacitance 30.0 [get_ports {A[13]}]
set_max_capacitance 30.0 [get_ports {A[14]}]
set_max_capacitance 30.0 [get_ports {A[15]}]
set_max_capacitance 30.0 [get_ports {B[0]}]
set_max_capacitance 30.0 [get_ports {B[1]}]
set_max_capacitance 30.0 [get_ports {B[2]}]
set_max_capacitance 30.0 [get_ports {B[3]}]
set_max_capacitance 30.0 [get_ports {B[4]}]
set_max_capacitance 30.0 [get_ports {B[5]}]
set_max_capacitance 30.0 [get_ports {B[6]}]
set_max_capacitance 30.0 [get_ports {B[7]}]
set_max_capacitance 30.0 [get_ports {B[8]}]
set_max_capacitance 30.0 [get_ports {B[9]}]
set_max_capacitance 30.0 [get_ports {B[10]}]
set_max_capacitance 30.0 [get_ports {B[11]}]
set_max_capacitance 30.0 [get_ports {B[12]}]
set_max_capacitance 30.0 [get_ports {B[13]}]
set_max_capacitance 30.0 [get_ports {B[14]}]
set_max_capacitance 30.0 [get_ports {B[15]}]
set_max_capacitance 30.0 [get_ports {C[0]}]
set_max_capacitance 30.0 [get_ports {C[1]}]
set_max_capacitance 30.0 [get_ports {C[2]}]
set_max_capacitance 30.0 [get_ports {C[3]}]
set_max_capacitance 30.0 [get_ports {C[4]}]
set_max_capacitance 30.0 [get_ports {C[5]}]
set_max_capacitance 30.0 [get_ports {C[6]}]
set_max_capacitance 30.0 [get_ports {C[7]}]
set_max_capacitance 30.0 [get_ports {C[8]}]
set_max_capacitance 30.0 [get_ports {C[9]}]
set_max_capacitance 30.0 [get_ports {C[10]}]
set_max_capacitance 30.0 [get_ports {C[11]}]
set_max_capacitance 30.0 [get_ports {C[12]}]
set_max_capacitance 30.0 [get_ports {C[13]}]
set_max_capacitance 30.0 [get_ports {C[14]}]
set_max_capacitance 30.0 [get_ports {C[15]}]
set_max_capacitance 30.0 [get_ports {C[16]}]
set_max_capacitance 30.0 [get_ports {C[17]}]
set_max_capacitance 30.0 [get_ports {C[18]}]
set_max_capacitance 30.0 [get_ports {C[19]}]
set_max_capacitance 30.0 [get_ports {C[20]}]
set_max_capacitance 30.0 [get_ports {C[21]}]
set_max_capacitance 30.0 [get_ports {C[22]}]
set_max_capacitance 30.0 [get_ports {C[23]}]
set_max_capacitance 30.0 [get_ports {C[24]}]
set_max_capacitance 30.0 [get_ports {C[25]}]
set_max_capacitance 30.0 [get_ports {C[26]}]
set_max_capacitance 30.0 [get_ports {C[27]}]
set_max_capacitance 30.0 [get_ports {C[28]}]
set_max_capacitance 30.0 [get_ports {C[29]}]
set_max_capacitance 30.0 [get_ports {C[30]}]
set_max_capacitance 30.0 [get_ports {C[31]}]
set_input_transition 0.12 [get_ports clk]
set_input_transition 0.12 [get_ports rst]
set_input_transition 0.12 [get_ports {A[0]}]
set_input_transition 0.12 [get_ports {A[1]}]
set_input_transition 0.12 [get_ports {A[2]}]
set_input_transition 0.12 [get_ports {A[3]}]
set_input_transition 0.12 [get_ports {A[4]}]
set_input_transition 0.12 [get_ports {A[5]}]
set_input_transition 0.12 [get_ports {A[6]}]
set_input_transition 0.12 [get_ports {A[7]}]
set_input_transition 0.12 [get_ports {A[8]}]
set_input_transition 0.12 [get_ports {A[9]}]
set_input_transition 0.12 [get_ports {A[10]}]
set_input_transition 0.12 [get_ports {A[11]}]
set_input_transition 0.12 [get_ports {A[12]}]
set_input_transition 0.12 [get_ports {A[13]}]
set_input_transition 0.12 [get_ports {A[14]}]
set_input_transition 0.12 [get_ports {A[15]}]
set_input_transition 0.12 [get_ports {B[0]}]
set_input_transition 0.12 [get_ports {B[1]}]
set_input_transition 0.12 [get_ports {B[2]}]
set_input_transition 0.12 [get_ports {B[3]}]
set_input_transition 0.12 [get_ports {B[4]}]
set_input_transition 0.12 [get_ports {B[5]}]
set_input_transition 0.12 [get_ports {B[6]}]
set_input_transition 0.12 [get_ports {B[7]}]
set_input_transition 0.12 [get_ports {B[8]}]
set_input_transition 0.12 [get_ports {B[9]}]
set_input_transition 0.12 [get_ports {B[10]}]
set_input_transition 0.12 [get_ports {B[11]}]
set_input_transition 0.12 [get_ports {B[12]}]
set_input_transition 0.12 [get_ports {B[13]}]
set_input_transition 0.12 [get_ports {B[14]}]
set_input_transition 0.12 [get_ports {B[15]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
